/*
            S.O.L.I.D.

1. Single Responsibility Principle - Принцип единственной ответственности
                                     У класса должна быть только 
                                     одна причина для изменения.

2. Open-Closed Principle           - Принцип открытости/закрытости программные сущности … должны быть 
                                     открыты для расширения, но закрыты для модификации.

3. Liskov substitution principle   - Принцип подстановки Лисков
                                     функции, которые используют базовый тип, 
                                     должны иметь возможность использовать подтипы 
                                     базового типа не зная об этом

4. Interface segregation principle - Принцип разделения интерфейса
                                     много интерфейсов, специально предназначенных для клиентов, 
                                     лучше, чем один интерфейс общего назначения

5. Dependency inversion principle  - Принцип инверсии зависимостей ()
                                     Зависимость на Абстракциях. 
                                     Нет зависимости на что-то конкретное
 
*/
